; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-5nodes-1000size-4degree-100mindistance-4trucks-4packages-949seed

(define (problem transport-three-cities-sequential-5nodes-1000size-4degree-100mindistance-4trucks-4packages-949seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-3-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  city-3-loc-5 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  truck-4 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 481,567 -> 344,680
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 18)
  ; 344,680 -> 481,567
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 18)
  ; 481,567 -> 839,321
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 44)
  ; 839,321 -> 481,567
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 44)
  ; 891,584 -> 344,680
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 56)
  ; 344,680 -> 891,584
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 56)
  ; 891,584 -> 839,321
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 27)
  ; 839,321 -> 891,584
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 27)
  ; 891,584 -> 481,567
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 41)
  ; 481,567 -> 891,584
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 41)
  ; 331,13 -> 839,321
  (road city-1-loc-5 city-1-loc-2)
  (= (road-length city-1-loc-5 city-1-loc-2) 60)
  ; 839,321 -> 331,13
  (road city-1-loc-2 city-1-loc-5)
  (= (road-length city-1-loc-2 city-1-loc-5) 60)
  ; 331,13 -> 481,567
  (road city-1-loc-5 city-1-loc-3)
  (= (road-length city-1-loc-5 city-1-loc-3) 58)
  ; 481,567 -> 331,13
  (road city-1-loc-3 city-1-loc-5)
  (= (road-length city-1-loc-3 city-1-loc-5) 58)
  ; 2286,24 -> 2853,128
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 58)
  ; 2853,128 -> 2286,24
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 58)
  ; 2954,392 -> 2853,128
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 29)
  ; 2853,128 -> 2954,392
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 29)
  ; 2126,223 -> 2286,24
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 26)
  ; 2286,24 -> 2126,223
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 26)
  ; 2391,174 -> 2853,128
  (road city-2-loc-5 city-2-loc-1)
  (= (road-length city-2-loc-5 city-2-loc-1) 47)
  ; 2853,128 -> 2391,174
  (road city-2-loc-1 city-2-loc-5)
  (= (road-length city-2-loc-1 city-2-loc-5) 47)
  ; 2391,174 -> 2286,24
  (road city-2-loc-5 city-2-loc-2)
  (= (road-length city-2-loc-5 city-2-loc-2) 19)
  ; 2286,24 -> 2391,174
  (road city-2-loc-2 city-2-loc-5)
  (= (road-length city-2-loc-2 city-2-loc-5) 19)
  ; 2391,174 -> 2954,392
  (road city-2-loc-5 city-2-loc-3)
  (= (road-length city-2-loc-5 city-2-loc-3) 61)
  ; 2954,392 -> 2391,174
  (road city-2-loc-3 city-2-loc-5)
  (= (road-length city-2-loc-3 city-2-loc-5) 61)
  ; 2391,174 -> 2126,223
  (road city-2-loc-5 city-2-loc-4)
  (= (road-length city-2-loc-5 city-2-loc-4) 27)
  ; 2126,223 -> 2391,174
  (road city-2-loc-4 city-2-loc-5)
  (= (road-length city-2-loc-4 city-2-loc-5) 27)
  ; 1713,2657 -> 1451,2304
  (road city-3-loc-3 city-3-loc-1)
  (= (road-length city-3-loc-3 city-3-loc-1) 44)
  ; 1451,2304 -> 1713,2657
  (road city-3-loc-1 city-3-loc-3)
  (= (road-length city-3-loc-1 city-3-loc-3) 44)
  ; 1531,2105 -> 1451,2304
  (road city-3-loc-4 city-3-loc-1)
  (= (road-length city-3-loc-4 city-3-loc-1) 22)
  ; 1451,2304 -> 1531,2105
  (road city-3-loc-1 city-3-loc-4)
  (= (road-length city-3-loc-1 city-3-loc-4) 22)
  ; 1531,2105 -> 1713,2657
  (road city-3-loc-4 city-3-loc-3)
  (= (road-length city-3-loc-4 city-3-loc-3) 59)
  ; 1713,2657 -> 1531,2105
  (road city-3-loc-3 city-3-loc-4)
  (= (road-length city-3-loc-3 city-3-loc-4) 59)
  ; 1395,2389 -> 1451,2304
  (road city-3-loc-5 city-3-loc-1)
  (= (road-length city-3-loc-5 city-3-loc-1) 11)
  ; 1451,2304 -> 1395,2389
  (road city-3-loc-1 city-3-loc-5)
  (= (road-length city-3-loc-1 city-3-loc-5) 11)
  ; 1395,2389 -> 1061,2838
  (road city-3-loc-5 city-3-loc-2)
  (= (road-length city-3-loc-5 city-3-loc-2) 56)
  ; 1061,2838 -> 1395,2389
  (road city-3-loc-2 city-3-loc-5)
  (= (road-length city-3-loc-2 city-3-loc-5) 56)
  ; 1395,2389 -> 1713,2657
  (road city-3-loc-5 city-3-loc-3)
  (= (road-length city-3-loc-5 city-3-loc-3) 42)
  ; 1713,2657 -> 1395,2389
  (road city-3-loc-3 city-3-loc-5)
  (= (road-length city-3-loc-3 city-3-loc-5) 42)
  ; 1395,2389 -> 1531,2105
  (road city-3-loc-5 city-3-loc-4)
  (= (road-length city-3-loc-5 city-3-loc-4) 32)
  ; 1531,2105 -> 1395,2389
  (road city-3-loc-4 city-3-loc-5)
  (= (road-length city-3-loc-4 city-3-loc-5) 32)
  ; 891,584 <-> 2126,223
  (road city-1-loc-4 city-2-loc-4)
  (= (road-length city-1-loc-4 city-2-loc-4) 129)
  (road city-2-loc-4 city-1-loc-4)
  (= (road-length city-2-loc-4 city-1-loc-4) 129)
  (road city-1-loc-2 city-3-loc-2)
  (= (road-length city-1-loc-2 city-3-loc-2) 148)
  (road city-3-loc-2 city-1-loc-2)
  (= (road-length city-3-loc-2 city-1-loc-2) 148)
  (road city-2-loc-5 city-3-loc-4)
  (= (road-length city-2-loc-5 city-3-loc-4) 181)
  (road city-3-loc-4 city-2-loc-5)
  (= (road-length city-3-loc-4 city-2-loc-5) 181)
  (at package-1 city-2-loc-2)
  (at package-2 city-2-loc-5)
  (at package-3 city-1-loc-4)
  (at package-4 city-3-loc-3)
  (at truck-1 city-2-loc-4)
  (capacity truck-1 capacity-3)
  (at truck-2 city-1-loc-2)
  (capacity truck-2 capacity-2)
  (at truck-3 city-3-loc-5)
  (capacity truck-3 capacity-4)
  (at truck-4 city-1-loc-5)
  (capacity truck-4 capacity-2)
 )
 (:goal (and
  (at package-1 city-3-loc-1)
  (at package-2 city-3-loc-3)
  (at package-3 city-3-loc-5)
  (at package-4 city-3-loc-4)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-1 city-2-loc-4 city-1-loc-4)
   deleted: (at truck-1 city-2-loc-4)
   added: (at truck-1 city-1-loc-4)
   goals met: 0 of 4
2. (pick-up truck-1 city-1-loc-4 package-3 capacity-2 capacity-3)
   deleted: (at package-3 city-1-loc-4) (capacity truck-1 capacity-3)
   added: (in package-3 truck-1) (capacity truck-1 capacity-2)
   goals met: 0 of 4
3. (drive truck-1 city-1-loc-4 city-2-loc-4)
   deleted: (at truck-1 city-1-loc-4)
   added: (at truck-1 city-2-loc-4)
   goals met: 0 of 4
4. (drive truck-1 city-2-loc-4 city-2-loc-2)
   deleted: (at truck-1 city-2-loc-4)
   added: (at truck-1 city-2-loc-2)
   goals met: 0 of 4
5. (pick-up truck-1 city-2-loc-2 package-1 capacity-1 capacity-2)
   deleted: (at package-1 city-2-loc-2) (capacity truck-1 capacity-2)
   added: (in package-1 truck-1) (capacity truck-1 capacity-1)
   goals met: 0 of 4
6. (drive truck-1 city-2-loc-2 city-2-loc-5)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-2-loc-5)
   goals met: 0 of 4
7. (pick-up truck-1 city-2-loc-5 package-2 capacity-0 capacity-1)
   deleted: (at package-2 city-2-loc-5) (capacity truck-1 capacity-1)
   added: (in package-2 truck-1) (capacity truck-1 capacity-0)
   goals met: 0 of 4
8. (drive truck-1 city-2-loc-5 city-3-loc-4)
   deleted: (at truck-1 city-2-loc-5)
   added: (at truck-1 city-3-loc-4)
   goals met: 0 of 4
9. (drive truck-1 city-3-loc-4 city-3-loc-1)
   deleted: (at truck-1 city-3-loc-4)
   added: (at truck-1 city-3-loc-1)
   goals met: 0 of 4
10. (drop truck-1 city-3-loc-1 package-1 capacity-0 capacity-1)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-0)
   added: (at package-1 city-3-loc-1) (capacity truck-1 capacity-1)
   goals met: 1 of 4
11. (drive truck-1 city-3-loc-1 city-3-loc-3)
   deleted: (at truck-1 city-3-loc-1)
   added: (at truck-1 city-3-loc-3)
   goals met: 1 of 4
12. (drop truck-1 city-3-loc-3 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-1)
   added: (at package-2 city-3-loc-3) (capacity truck-1 capacity-2)
   goals met: 2 of 4
13. (pick-up truck-1 city-3-loc-3 package-4 capacity-1 capacity-2)
   deleted: (at package-4 city-3-loc-3) (capacity truck-1 capacity-2)
   added: (in package-4 truck-1) (capacity truck-1 capacity-1)
   goals met: 2 of 4
14. (drive truck-1 city-3-loc-3 city-3-loc-4)
   deleted: (at truck-1 city-3-loc-3)
   added: (at truck-1 city-3-loc-4)
   goals met: 2 of 4
15. (drop truck-1 city-3-loc-4 package-4 capacity-1 capacity-2)
   deleted: (in package-4 truck-1) (capacity truck-1 capacity-1)
   added: (at package-4 city-3-loc-4) (capacity truck-1 capacity-2)
   goals met: 3 of 4
16. (drive truck-1 city-3-loc-4 city-3-loc-5)
   deleted: (at truck-1 city-3-loc-4)
   added: (at truck-1 city-3-loc-5)
   goals met: 3 of 4
17. (drop truck-1 city-3-loc-5 package-3 capacity-2 capacity-3)
   deleted: (in package-3 truck-1) (capacity truck-1 capacity-2)
   added: (at package-3 city-3-loc-5) (capacity truck-1 capacity-3)
   goals met: 4 of 4
